In [6]:
# Import the required libraries and dependencies
import os
import pandas as pd
import plotly.express as px
from pathlib import Path
from dotenv import load_dotenv
import hvplot.pandas

In [7]:
# create airbnb_listingdata dataframe
airbnb_listingdata_df =  pd.read_csv(
    Path("Data/listings.csv")
)

# Review the first and last five rows of the DataFrame
display(airbnb_listingdata_df.head())
display(airbnb_listingdata_df.tail())

,id,listing_url,scrape_id,last_scraped,name,summary,space,description,experiences_offered,neighborhood_overview,...,review_scores_value,requires_license,license,jurisdiction_names,instant_bookable,cancellation_policy,require_guest_profile_picture,require_guest_phone_verification,calculated_host_listings_count,reviews_per_month
0,241032,https://www.airbnb.com/rooms/241032,20160104002432,2016-01-04,Stylish Queen Anne Apartment,NaN,Make your self at home in this charming one-be...,Make your self at home in this charming one-be...,none,NaN,...,10.0,f,NaN,WASHINGTON,f,moderate,f,f,2,4.07
1,953595,https://www.airbnb.com/rooms/953595,20160104002432,2016-01-04,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",Chemically sensitive? We've removed the irrita...,none,"Queen Anne is a wonderful, truly functional vi...",...,10.0,f,NaN,WASHINGTON,f,strict,t,t,6,1.48
2,3308979,https://www.airbnb.com/rooms/3308979,20160104002432,2016-01-04,New Modern House-Amazing water view,New modern house built in 2013. Spectacular s...,"Our house is modern, light and fresh with a wa...",New modern house built in 2013. Spectacular s...,none,Upper Queen Anne is a charming neighborhood fu...,...,10.0,f,NaN,WASHINGTON,f,strict,f,f,2,1.15
3,7421966,https://www.airbnb.com/rooms/7421966,20160104002432,2016-01-04,Queen Anne Chateau,A charming apartment that sits atop Queen Anne...,NaN,A charming apartment that sits atop Queen Anne...,none,NaN,...,NaN,f,NaN,WASHINGTON,f,flexible,f,f,1,NaN
4,278830,https://www.airbnb.com/rooms/278830,20160104002432,2016-01-04,Charming craftsman 3 bdm house,Cozy family craftman house in beautiful neighb...,Cozy family craftman house in beautiful neighb...,Cozy family craftman house in beautiful neighb...,none,We are in the beautiful neighborhood of Queen ...,...,9.0,f,NaN,WASHINGTON,f,strict,f,f,1,0.89

,id,listing_url,scrape_id,last_scraped,name,summary,space,description,experiences_offered,neighborhood_overview,...,review_scores_value,requires_license,license,jurisdiction_names,instant_bookable,cancellation_policy,require_guest_profile_picture,require_guest_phone_verification,calculated_host_listings_count,reviews_per_month
3813,8101950,https://www.airbnb.com/rooms/8101950,20160104002432,2016-01-04,3BR Mountain View House in Seattle,Our 3BR/2BA house boasts incredible views of t...,"Our 3BR/2BA house bright, stylish, and wheelch...",Our 3BR/2BA house boasts incredible views of t...,none,We're located near lots of family fun. Woodlan...,...,8.0,f,NaN,WASHINGTON,f,strict,f,f,8,0.3
3814,8902327,https://www.airbnb.com/rooms/8902327,20160104002432,2016-01-04,Portage Bay View!-One Bedroom Apt,800 square foot 1 bedroom basement apartment w...,This space has a great view of Portage Bay wit...,800 square foot 1 bedroom basement apartment w...,none,The neighborhood is a quiet oasis that is clos...,...,10.0,f,NaN,WASHINGTON,f,moderate,f,f,1,2.0
3815,10267360,https://www.airbnb.com/rooms/10267360,20160104002432,2016-01-04,Private apartment view of Lake WA,"Very comfortable lower unit. Quiet, charming m...",NaN,"Very comfortable lower unit. Quiet, charming m...",none,NaN,...,NaN,f,NaN,WASHINGTON,f,moderate,f,f,1,NaN
3816,9604740,https://www.airbnb.com/rooms/9604740,20160104002432,2016-01-04,Amazing View with Modern Comfort!,Cozy studio condo in the heart on Madison Park...,Fully furnished unit to accommodate most needs...,Cozy studio condo in the heart on Madison Park...,none,Madison Park offers a peaceful slow pace upsca...,...,NaN,f,NaN,WASHINGTON,f,moderate,f,f,1,NaN
3817,10208623,https://www.airbnb.com/rooms/10208623,20160104002432,2016-01-04,Large Lakefront Apartment,"All hardwood floors, fireplace, 65"" TV with Xb...",NaN,"All hardwood floors, fireplace, 65"" TV with Xb...",none,NaN,...,NaN,f,NaN,WASHINGTON,f,flexible,f,f,1,NaN

In [8]:
# filter airbnb_listingdata_df columns
columns = [ "id", "neighbourhood",  "zipcode", "latitude", "longitude", "property_type", "room_type", "bedrooms", "bathrooms","price"]
airbnb_listingdata_df = airbnb_listingdata_df[columns]
display(airbnb_listingdata_df.head())
display(airbnb_listingdata_df.tail())

,id,neighbourhood,zipcode,latitude,longitude,property_type,room_type,bedrooms,bathrooms,price
0,241032,Queen Anne,98119,47.636289,-122.371025,Apartment,Entire home/apt,1.0,1.0,$85.00
1,953595,Queen Anne,98119,47.639123,-122.365666,Apartment,Entire home/apt,1.0,1.0,$150.00
2,3308979,Queen Anne,98119,47.629724,-122.369483,House,Entire home/apt,5.0,4.5,$975.00
3,7421966,Queen Anne,98119,47.638473,-122.369279,Apartment,Entire home/apt,0.0,1.0,$100.00
4,278830,Queen Anne,98119,47.632918,-122.372471,House,Entire home/apt,3.0,2.0,$450.00

,id,neighbourhood,zipcode,latitude,longitude,property_type,room_type,bedrooms,bathrooms,price
3813,8101950,Fremont,98107,47.664295,-122.359170,House,Entire home/apt,3.0,2.0,$359.00
3814,8902327,Portage Bay,98102,47.649552,-122.318309,Apartment,Entire home/apt,1.0,1.0,$79.00
3815,10267360,NaN,98178,47.508453,-122.240607,House,Entire home/apt,1.0,1.0,$93.00
3816,9604740,NaN,98112,47.632335,-122.275530,Condominium,Entire home/apt,0.0,1.0,$99.00
3817,10208623,Queen Anne,98109,47.641186,-122.342085,Apartment,Entire home/apt,2.0,1.5,$87.00

In [23]:
# select only rows with property_type as 'Apartment' or 'House'
options = ['Apartment', 'House']
airbnb_listingdata_df = airbnb_listingdata_df[airbnb_listingdata_df['property_type'].isin(options)]

display(airbnb_listingdata_df.head())
display(airbnb_listingdata_df.tail())

,id,neighbourhood,zipcode,latitude,longitude,property_type,room_type,bedrooms,bathrooms,price
0,241032,Queen Anne,98119,47.636289,-122.371025,Apartment,Entire home/apt,1.0,1.0,$85.00
1,953595,Queen Anne,98119,47.639123,-122.365666,Apartment,Entire home/apt,1.0,1.0,$150.00
2,3308979,Queen Anne,98119,47.629724,-122.369483,House,Entire home/apt,5.0,4.5,$975.00
3,7421966,Queen Anne,98119,47.638473,-122.369279,Apartment,Entire home/apt,0.0,1.0,$100.00
4,278830,Queen Anne,98119,47.632918,-122.372471,House,Entire home/apt,3.0,2.0,$450.00

,id,neighbourhood,zipcode,latitude,longitude,property_type,room_type,bedrooms,bathrooms,price
3812,3383329,Fremont,98107,47.654516,-122.358124,Apartment,Entire home/apt,1.0,1.0,$95.00
3813,8101950,Fremont,98107,47.664295,-122.359170,House,Entire home/apt,3.0,2.0,$359.00
3814,8902327,Portage Bay,98102,47.649552,-122.318309,Apartment,Entire home/apt,1.0,1.0,$79.00
3815,10267360,NaN,98178,47.508453,-122.240607,House,Entire home/apt,1.0,1.0,$93.00
3817,10208623,Queen Anne,98109,47.641186,-122.342085,Apartment,Entire home/apt,2.0,1.5,$87.00

In [25]:
# remove invalid values

airbnb_listingdata_df = airbnb_listingdata_df.dropna()
display(airbnb_listingdata_df.head())
display(airbnb_listingdata_df.tail())

,id,neighbourhood,zipcode,latitude,longitude,property_type,room_type,bedrooms,bathrooms,price
0,241032,Queen Anne,98119,47.636289,-122.371025,Apartment,Entire home/apt,1.0,1.0,$85.00
1,953595,Queen Anne,98119,47.639123,-122.365666,Apartment,Entire home/apt,1.0,1.0,$150.00
2,3308979,Queen Anne,98119,47.629724,-122.369483,House,Entire home/apt,5.0,4.5,$975.00
3,7421966,Queen Anne,98119,47.638473,-122.369279,Apartment,Entire home/apt,0.0,1.0,$100.00
4,278830,Queen Anne,98119,47.632918,-122.372471,House,Entire home/apt,3.0,2.0,$450.00

,id,neighbourhood,zipcode,latitude,longitude,property_type,room_type,bedrooms,bathrooms,price
3811,8578490,Fremont,98103,47.657898,-122.346692,Apartment,Entire home/apt,1.0,1.0,$65.00
3812,3383329,Fremont,98107,47.654516,-122.358124,Apartment,Entire home/apt,1.0,1.0,$95.00
3813,8101950,Fremont,98107,47.664295,-122.359170,House,Entire home/apt,3.0,2.0,$359.00
3814,8902327,Portage Bay,98102,47.649552,-122.318309,Apartment,Entire home/apt,1.0,1.0,$79.00
3817,10208623,Queen Anne,98109,47.641186,-122.342085,Apartment,Entire home/apt,2.0,1.5,$87.00

In [26]:
# find duplicate values in airbnb_listingdata_df
airbnb_listingdata_df.duplicated().sum()

0

In [28]:
# Use the dtypes function to check the data type of each column in the DataFrame
airbnb_listingdata_df.dtypes

id                 int64
neighbourhood     object
zipcode           object
latitude         float64
longitude        float64
property_type     object
room_type         object
bedrooms         float64
bathrooms        float64
price             object
dtype: object

In [30]:
# For all the rows in the "price", use the str.replace function 
# to replace the "$" with empty strings ("")
airbnb_listingdata_df.loc[:, "price"] = airbnb_listingdata_df.loc[:, "price"].str.replace("$", "")

# Call the head function to review the first 5 rows of the DataFrame
airbnb_listingdata_df.head()

,id,neighbourhood,zipcode,latitude,longitude,property_type,room_type,bedrooms,bathrooms,price
0,241032,Queen Anne,98119,47.636289,-122.371025,Apartment,Entire home/apt,1.0,1.0,85.00
1,953595,Queen Anne,98119,47.639123,-122.365666,Apartment,Entire home/apt,1.0,1.0,150.00
2,3308979,Queen Anne,98119,47.629724,-122.369483,House,Entire home/apt,5.0,4.5,975.00
3,7421966,Queen Anne,98119,47.638473,-122.369279,Apartment,Entire home/apt,0.0,1.0,100.00
4,278830,Queen Anne,98119,47.632918,-122.372471,House,Entire home/apt,3.0,2.0,450.00

In [37]:
# For all the rows in the "price", use the str.replace function 
# to replace the "," with empty strings ("")
airbnb_listingdata_df.loc[:, "price"] = airbnb_listingdata_df.loc[:, "price"].str.replace(",", "")

# Call the head function to review the first 5 rows of the DataFrame
airbnb_listingdata_df.head()

,id,neighbourhood,zipcode,latitude,longitude,property_type,room_type,bedrooms,bathrooms,price
0,241032,Queen Anne,98119,47.636289,-122.371025,Apartment,Entire home/apt,1.0,1.0,85.00
1,953595,Queen Anne,98119,47.639123,-122.365666,Apartment,Entire home/apt,1.0,1.0,150.00
2,3308979,Queen Anne,98119,47.629724,-122.369483,House,Entire home/apt,5.0,4.5,975.00
3,7421966,Queen Anne,98119,47.638473,-122.369279,Apartment,Entire home/apt,0.0,1.0,100.00
4,278830,Queen Anne,98119,47.632918,-122.372471,House,Entire home/apt,3.0,2.0,450.00

In [38]:
# For all the rows in "price", use the astype function 
# to change the data type from Object (string) to float
airbnb_listingdata_df["price"] = airbnb_listingdata_df["price"].astype(float)
# Call the dtypes function on the `airbnb_listingdata_df` DataFrame to confirm the update
airbnb_listingdata_df.dtypes

id                 int64
neighbourhood     object
zipcode           object
latitude         float64
longitude        float64
property_type     object
room_type         object
bedrooms         float64
bathrooms        float64
price            float64
dtype: object

In [5]:
# create airbnb_calendardata dataframe
airbnb_calendardata_df =  pd.read_csv(
    Path("Data/calendar.csv")
)

# Review the first and last five rows of the DataFrame
display(airbnb_calendardata_df.head())
display(airbnb_calendardata_df.tail())

   listing_id        date available   price
0      241032  2016-01-04         t  $85.00
1      241032  2016-01-05         t  $85.00
2      241032  2016-01-06         f     NaN
3      241032  2016-01-07         f     NaN
4      241032  2016-01-08         f     NaN

         listing_id        date available price
1393565    10208623  2016-12-29         f   NaN
1393566    10208623  2016-12-30         f   NaN
1393567    10208623  2016-12-31         f   NaN
1393568    10208623  2017-01-01         f   NaN
1393569    10208623  2017-01-02         f   NaN

In [39]:
# remove invalid values

airbnb_calendardata_df = airbnb_calendardata_df.dropna()
display(airbnb_calendardata_df.head())
display(airbnb_calendardata_df.tail())

    listing_id        date available   price
0       241032  2016-01-04         t  $85.00
1       241032  2016-01-05         t  $85.00
9       241032  2016-01-13         t  $85.00
10      241032  2016-01-14         t  $85.00
14      241032  2016-01-18         t  $85.00

         listing_id        date available   price
1393207    10208623  2016-01-06         t  $87.00
1393208    10208623  2016-01-07         t  $87.00
1393211    10208623  2016-01-10         t  $87.00
1393212    10208623  2016-01-11         t  $87.00
1393213    10208623  2016-01-12         t  $87.00

In [40]:
# find duplicate values in airbnb_calendardata_df
airbnb_calendardata_df.duplicated().sum()

0

In [41]:
# Use the dtypes function to check the data type of each column in the DataFrame
airbnb_calendardata_df.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [42]:
# For all the rows in the "price", use the str.replace function 
# to replace the "$" with empty strings ("")
airbnb_calendardata_df.loc[:, "price"] = airbnb_calendardata_df.loc[:, "price"].str.replace("$", "")

# Call the head function to review the first 5 rows of the DataFrame
airbnb_calendardata_df.head()

    listing_id        date available  price
0       241032  2016-01-04         t  85.00
1       241032  2016-01-05         t  85.00
9       241032  2016-01-13         t  85.00
10      241032  2016-01-14         t  85.00
14      241032  2016-01-18         t  85.00

In [44]:
# For all the rows in the "price", use the str.replace function 
# to replace the "," with empty strings ("")
airbnb_calendardata_df.loc[:, "price"] = airbnb_calendardata_df.loc[:, "price"].str.replace(",", "")

# Call the head function to review the first 5 rows of the DataFrame
airbnb_calendardata_df.head()

    listing_id        date available  price
0       241032  2016-01-04         t  85.00
1       241032  2016-01-05         t  85.00
9       241032  2016-01-13         t  85.00
10      241032  2016-01-14         t  85.00
14      241032  2016-01-18         t  85.00

In [45]:
# For all the rows in "price", use the astype function 
# to change the data type from Object (string) to float
airbnb_calendardata_df["price"] = airbnb_calendardata_df["price"].astype(float)
# Call the dtypes function on the `airbnb_calendardata_df` DataFrame to confirm the update
airbnb_calendardata_df.dtypes

listing_id      int64
date           object
available      object
price         float64
dtype: object